Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination
Serialization structure for AnalysisLoadCombination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination._AnalysisObject
The analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination._NumberOfGroupIds
The number of identifiers of the groups of the analysis load combination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination._GroupIds
The identifier of the groups of the analysis load combination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination._Name
The name of the analysis load combination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination._Type
The type of the analysis load combination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination._NumberOfScalingFactors
The number of scaling factors of the analysis load combination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination._ScalingFactors
The scaling factors of the analysis load combination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination._NumberOfReductionFactors
The number of reduction factors of the analysis load combination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination._ReductionFactors
The reduction factors of the analysis load combination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination._NumberOfPartialSafetyFactors
The number of partial safety factors of the analysis load combination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination._PartialSafetyFactors
The partial safety factors of the analysis load combination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination.ToStruct(Tekla.Structures.Analysis.AnalysisLoadCombination)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination.FromStruct(Tekla.Structures.Analysis.AnalysisLoadCombination)
DO NOT USE! For internal usage only!
P: P.